#Задание 1
print(f'От начала суток прошла 1/5 того времени, что осталось до конца суток. Который час?\n')

TOTAL_HOURS = 24

sum = TOTAL_HOURS/6
print(f'Сейчас {sum} часов')

""""
У нас получается уровнение,
где нам известно, что в сутках 24 часа, 
а вот сколько прошло нам неизвестно(x).
Из условия задачи у нас есть что от начало суток прошло 1/5
И если записывать это как уровнение, то получится
x = (1/5) * (24 - x)
Так как у нас дробь, умножаем на 5
5x = 24 - x
5x + x = 24
6x = 24
x = 4
"""

#Задание 2 *
""""
...
"""

#Задание 3
"""
от дома Джонатана (Д) до офиса Гвидо (Г) — 15 км
от Вирусологического центра (В) до офиса Гвидо (Г) — 17 км
На каком расстоянии от дома Джонатана находится Вирусологический центр?
"""

D_to_G = 15 #дано в задаче
G_to_v = 17#дано в задаче

distance = D_to_G + G_to_v #на сложение нам указывают слова "на каком расстоянии"

print(distance)

#Задание 3 *

""""
...
"""

#Задание 5 *
""""
...
"""
#Задание 6 *

""""
...
"""